Repository: freeabyss/assistant
Catalog: SnapVault/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# onboarding.done.description
source: You can now use the search shortcut, clipboard history, screenshots, and menu bar entry.
zh_hans: 现在可以使用搜索快捷键、剪贴板历史、截图和菜单栏入口。

# onboarding.continue
source: Continue
zh_hans: 继续

# onboarding.finish
source: Finish
zh_hans: 完成

# onboarding.quit
source: Quit Assistant
zh_hans: 退出 Assistant

# onboarding.error.permissionsRequired
source: Complete the required shortcut, clipboard acknowledgment, Screen Recording, and Accessibility steps first.
zh_hans: 请先完成快捷键、剪贴板确认、屏幕录制权限和辅助功能权限步骤。

# management.title
source: Management Center
zh_hans: 管理中心

# management.page.overview
source: Overview
zh_hans: 概览

# management.page.clipboard
source: Clipboard History
zh_hans: 剪贴板历史

# management.page.settings
source: Settings
zh_hans: 设置

# management.page.permissions
source: Permissions
zh_hans: 权限

# management.overview.subtitle
source: Status, shortcuts, enabled sources, and quick entries.
zh_hans: 查看状态、快捷键、已启用搜索源与快捷入口。

# management.overview.quickEntries
source: Quick entries
zh_hans: 快捷入口

# management.overview.quickEntries.value
source: Search · Clipboard · Screenshots · Settings
zh_hans: 搜索 · 剪贴板 · 截图 · 设置

# management.overview.quickEntries.subtitle
source: Open common Assistant areas from the sidebar or menu bar.
zh_hans: 可从侧边栏或菜单栏打开常用功能。

# management.overview.permissions
source: Permissions
zh_hans: 权限

# management.overview.permissions.subtitle
source: Screen Recording and Accessibility are required for the full MVP experience.
zh_hans: 屏幕录制和辅助功能是完整 MVP 体验所需权限。

# management.overview.permissionsCount
source: %d of %d authorized
zh_hans: 已授权 %d / %d

# management.overview.sources
source: Enabled search sources
zh_hans: 开启的搜索源

# management.overview.sources.subtitle
source: Disabled sources are hidden from unified search results.
zh_hans: 关闭的来源不会出现在统一搜索结果中。

# management.overview.noSources
source: No source enabled
zh_hans: 没有开启的来源

# management.overview.hotkey
source: Search hotkey
zh_hans: 搜索快捷键

# management.overview.hotkey.subtitle
source: Use this shortcut to open or close the search panel.
zh_hans: 使用该快捷键打开或关闭搜索面板。

# management.overview.actions
source: Quick actions
zh_hans: 快捷操作

# management.settings.title
source: Settings
zh_hans: 设置

# management.settings.subtitle
source: Configure shortcuts, search sources, clipboard, screenshots, login, language, and blacklist.
zh_hans: 配置快捷键、搜索源、剪贴板、截图、开机启动、语言和黑名单。

# management.settings.shortcuts
source: Shortcuts
zh_hans: 快捷键

# management.shortcuts.search
source: Open Search
zh_hans: 打开搜索

# management.shortcuts.captureRegion
source: Capture Region
zh_hans: 区域截图

# management.shortcuts.captureWindow
source: Capture Window
zh_hans: 窗口截图

# management.settings.sources
source: Search sources
zh_hans: 搜索源

# management.source.app
source: Applications
zh_hans: 应用

# management.source.app.subtitle
source: Show installed apps in unified search.
zh_hans: 在统一搜索中展示已安装应用。

# management.source.command
source: Commands
zh_hans: 命令

# management.source.command.subtitle
source: Show built-in safe commands.
zh_hans: 展示内置安全命令。

# management.source.calculator
source: Calculator
zh_hans: 计算器

# management.source.calculator.subtitle
source: Show calculation and unit conversion results.
zh_hans: 展示计算和单位换算结果。

# management.source.settings
source: Settings
zh_hans: 设置

# management.source.settings.subtitle
source: Show settings and permission routes.
zh_hans: 展示设置与权限入口。

# management.source.clipboard
source: Clipboard
zh_hans: 剪贴板

# management.source.clipboard.subtitle
source: Show clipboard history matches in search.
zh_hans: 在搜索中展示剪贴板历史匹配结果。

# management.settings.clipboard
source: Clipboard
zh_hans: 剪贴板

# management.clipboard.enabled
source: Enable clipboard history recording
zh_hans: 启用剪贴板历史记录

# management.clipboard.retention
source: Retention
zh_hans: 保留时间

# management.retention.7d
source: 7 days
zh_hans: 7 天

# management.retention.30d
source: 30 days
zh_hans: 30 天

# management.retention.90d
source: 90 days
zh_hans: 90 天

# management.retention.forever
source: Forever
zh_hans: 永久

# management.settings.screenshot
source: Screenshots
zh_hans: 截图

# management.screenshot.saveDirectory
source: Save directory
zh_hans: 保存目录

# management.screenshot.choose
source: Choose...
zh_hans: 选择...

# management.settings.system
source: System
zh_hans: 系统

# management.language.system
source: Follow System
zh_hans: 跟随系统

# management.language.zh
source: Simplified Chinese
zh_hans: 简体中文

# management.language.restart.title
source: Restart required
zh_hans: 需要重启

# management.language.restart.message
source: Language changes are saved and take effect after restarting the app.
zh_hans: 语言设置已保存，重启应用后生效。

# management.settings.saved
source: Settings saved.
zh_hans: 设置已保存。

# management.settings.reset
source: Defaults restored.
zh_hans: 已恢复默认设置。

# management.blacklist.title
source: Search blacklist
zh_hans: 搜索黑名单

# management.blacklist.source
source: Source
zh_hans: 来源

# management.blacklist.resultID
source: Stable result ID
zh_hans: 稳定结果 ID

# management.blacklist.titleField
source: Title
zh_hans: 标题

# management.blacklist.type
source: Type
zh_hans: 类型

# management.blacklist.add
source: Add
zh_hans: 添加

# management.blacklist.empty
source: No hidden search results. Add a concrete result ID to hide it from search.
zh_hans: 暂无隐藏的搜索结果。添加具体结果 ID 后可将其从搜索中隐藏。

# management.blacklist.remove
source: Remove
zh_hans: 移除

# management.blacklist.validation
source: Source, result ID, and title are required.
zh_hans: 来源、结果 ID 和标题不能为空。

# management.blacklist.added
source: Blacklist item added.
zh_hans: 已添加黑名单项。

# management.blacklist.removed
source: Blacklist item removed.
zh_hans: 已移除黑名单项。

# management.permissions.title
source: Permissions
zh_hans: 权限

# management.permissions.subtitle
source: Check required macOS permissions, open System Settings, and re-detect status.
zh_hans: 查看所需 macOS 权限，打开系统设置并重新检测状态。

# management.permission.screenRecording
source: Screen Recording
zh_hans: 屏幕录制

# management.permission.screenRecording.description
source: Required for region, full-screen, and window screenshots.
zh_hans: 用于区域、全屏和窗口截图。

# management.permission.accessibility
source: Accessibility
zh_hans: 辅助功能

# management.permission.accessibility.description
source: Required for future system control, simulated shortcuts, and automation boundaries explained during Onboarding.
zh_hans: 用于后续系统控制、模拟快捷键和自动化能力；首次引导中已说明用途边界。

# management.permission.authorized
source: Authorized
zh_hans: 已授权

# management.permission.denied
source: Not authorized
zh_hans: 未授权

# management.permission.notDetermined
source: Not determined
zh_hans: 未决定

# management.permission.unknown
source: Unknown
zh_hans: 未知

# management.permissions.refresh
source: Re-detect
zh_hans: 重新检测

# management.error.title
source: Management Center Error
zh_hans: 管理中心错误

# screenshot.toolbar.cancel
source: Cancel
zh_hans: 取消

# screenshot.preview.title
source: Screenshot Preview
zh_hans: 截图预览

# screenshot.preview.escHint
source: Press Esc to cancel
zh_hans: 按 Esc 取消

# screenshot.preview.unavailable
source: Preview unavailable
zh_hans: 无法预览

# screenshot.toast.copied
source: Copied to clipboard
zh_hans: 已复制到剪贴板

# screenshot.toast.copyFailed
source: Copy failed: %@
zh_hans: 复制失败：%@

# screenshot.toast.saved
source: Saved to %@
zh_hans: 已保存到 %@

# screenshot.toast.saveFailed
source: Save failed: %@
zh_hans: 保存失败：%@

# screenshot.toast.annotateSoon
source: Annotation tools are coming next
zh_hans: 标注工具将在下一步实现

# screenshot.permission.title
source: Screen Recording permission required
zh_hans: 需要屏幕录制权限

# screenshot.permission.message
source: Assistant needs Screen Recording permission to capture screenshots. Grant it in System Settings, then try again.
zh_hans: Assistant 需要屏幕录制权限才能截图。请在系统设置中授权后重试。

# screenshot.permission.openSettings
source: Open System Settings
zh_hans: 打开系统设置

# screenshot.permission.cancel
source: Cancel
zh_hans: 取消

# annotation.color.red
source: Red
zh_hans: 红

# annotation.color.yellow
source: Yellow
zh_hans: 黄

# annotation.color.blue
source: Blue
zh_hans: 蓝

# annotation.color.green
source: Green
zh_hans: 绿

# annotation.color.white
source: White
zh_hans: 白

# annotation.color.black
source: Black
zh_hans: 黑

# annotation.lineWidth.thin
source: Thin
zh_hans: 细

# annotation.lineWidth.medium
source: Medium
zh_hans: 中

# annotation.lineWidth.thick
source: Thick
zh_hans: 粗

# annotation.lineWidth.help
source: Line width preset
zh_hans: 线宽预设

# annotation.textSize.small
source: Small
zh_hans: 小

# annotation.textSize.medium
source: Medium
zh_hans: 中

# annotation.textSize.large
source: Large
zh_hans: 大

# annotation.textSize.help
source: Text size preset
zh_hans: 文字大小预设

# annotation.hint
source: Draw on the screenshot, then copy or save the annotated PNG.
zh_hans: 在截图上绘制标注，然后复制或保存标注 PNG。
